public/pon-import/ponimport_reale.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
	              xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
	              xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
	              xmlns:tns="http://ponimport.ssi.sogei.it/services/" 
	              xmlns:requestns="http://ponimport.ssi.sogei.it/type/" 
	              xmlns:responsens="http://ws.sogei.it/output/" 
	              targetNamespace="http://ponimport.ssi.sogei.it/services/">
	
	<wsdl:types>
		<xsd:schema elementFormDefault="qualified">
			<xsd:import namespace="http://ponimport.ssi.sogei.it/type/" schemaLocation="ponimport-request.xsd"/>
			<xsd:import namespace="http://ws.sogei.it/output/" schemaLocation="ponimport-response.xsd"/>
		</xsd:schema>
	</wsdl:types>
	
	<wsdl:message name="Output">
		<wsdl:part name="Output" element="responsens:Output"/>
	</wsdl:message> 
	<wsdl:message name="Input">
		<wsdl:part name="Input" element="requestns:Input"/>
	</wsdl:message>
	
	<wsdl:portType name="PONImportPort">
		<wsdl:operation name="process">
			<wsdl:input message="tns:Input"/>
			<wsdl:output message="tns:Output"/>
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name="PONImportSoapBinding" type="tns:PONImportPort">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="process">
			<soap:operation soapAction="http://ponimport.ssi.sogei.it/wsdl/PONImport"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	
	
	<wsdl:service name="PONImport">
		<wsdl:port name="PONImportService" binding="tns:PONImportSoapBinding">
			<soap:address location="https://interop.adm.gov.it/ponimportsoap/services/ponimport"/>
		</wsdl:port>
	</wsdl:service>	
	
</wsdl:definitions>
